; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph5 - mode
	image4 - mode
	image3 - mode
	thermograph2 - mode
	infrared0 - mode
	infrared1 - mode
	infrared7 - mode
	thermograph6 - mode
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph6)
	(supports instrument0 image4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared7)
	(supports instrument1 infrared1)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument2 image4)
	(supports instrument2 image3)
	(supports instrument2 infrared7)
	(calibration_target instrument2 Star4)
	(supports instrument3 image4)
	(supports instrument3 image3)
	(supports instrument3 thermograph5)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph6)
	(supports instrument4 thermograph5)
	(supports instrument4 image3)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Planet5 image3)
	(have_image Planet5 thermograph5)
	(have_image Planet6 infrared7)
	(have_image Planet7 thermograph5)
	(have_image Planet7 infrared7)
	(have_image Star8 thermograph2)
	(have_image Star8 thermograph5)
	(have_image Star9 thermograph6)
	(have_image Planet10 infrared1)
))

)

; plan
1. (turn_to satellite2 star0 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star0)
   goals met: 0 of 10
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite2 planet5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet5)
   goals met: 0 of 10
5. (turn_to satellite1 groundstation1 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 10
6. (turn_to satellite0 star2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star2)
   goals met: 0 of 10
7. (take_image satellite2 planet5 instrument3 image3)
   added: (have_image planet5 image3)
   goals met: 1 of 10
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 10
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
10. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 10
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 10
12. (take_image satellite2 planet5 instrument3 thermograph5)
   added: (have_image planet5 thermograph5)
   goals met: 2 of 10
13. (turn_to satellite0 star9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star9)
   goals met: 2 of 10
14. (take_image satellite0 star9 instrument0 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 3 of 10
15. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 4 of 10
16. (take_image satellite0 star8 instrument0 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 5 of 10
17. (turn_to satellite1 planet10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet10)
   goals met: 5 of 10
18. (take_image satellite1 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 6 of 10
19. (turn_to satellite1 planet6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet6)
   goals met: 6 of 10
20. (take_image satellite1 planet6 instrument1 infrared7)
   added: (have_image planet6 infrared7)
   goals met: 7 of 10
21. (turn_to satellite1 planet7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet7)
   goals met: 7 of 10
22. (take_image satellite1 planet7 instrument1 infrared7)
   added: (have_image planet7 infrared7)
   goals met: 8 of 10
23. (turn_to satellite2 planet7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet7)
   goals met: 8 of 10
24. (take_image satellite2 planet7 instrument3 thermograph5)
   added: (have_image planet7 thermograph5)
   goals met: 9 of 10
25. (turn_to satellite2 star8 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star8)
   goals met: 9 of 10
26. (take_image satellite2 star8 instrument3 thermograph5)
   added: (have_image star8 thermograph5)
   goals met: 10 of 10
